brew 'awscli'
brew 'docker-compose'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'inetutils'
brew 'iperf3'
brew 'ipython'
brew 'jq'
brew 'mas'
brew 'mediainfo'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'p7zip'
brew 'pyenv'
brew 'python'
brew 'ruby-build'
brew 'shellcheck'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'android-platform-tools'
cask 'docker'
cask 'font-source-code-pro'
cask 'iterm2@nightly'
cask 'kitty'
