cask 'ableton-live-lite'
cask 'concept2-utility'
cask 'dolphin@dev'
cask 'deluge'
cask 'focusrite-control'
cask 'kodi'
cask 'native-access'
cask 'nvidia-geforce-now'
cask 'openemu@experimental'
cask 'parsec'
cask 'plex'
cask 'redream'
cask 'retroarch'
cask 'steam'
cask 'transmission'
cask 'qbittorrent'
cask 'xemu'
cask 'zwift'

# TODO: manual installs
# pcsx2
# cemu
# rpcs3
# ryujinx/yuzu

mas 'kindle', id: 302584613
