brew 'awscli'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'inetutils'
brew 'iperf3'
brew 'ipython'
brew 'jq'
brew 'mas'
brew 'mediainfo'
brew 'neofetch'
brew 'neovim'
brew 'node'
brew 'nvm'
brew 'p7zip'
brew 'pyenv'
brew 'python'
brew 'ruby-build'
brew 'shellcheck'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
cask 'alfred'
cask 'android-platform-tools'
cask 'bitwarden'
cask 'brave-browser'
cask 'docker'
cask 'discord'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'firefox'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'google-drive'
cask 'geekbench'
cask 'iina'
cask 'intellij-idea'
cask 'iterm2@nightly'
cask 'kitty'
cask 'microsoft-remote-desktop'
cask 'monitorcontrol'
cask 'protonvpn'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'zoom'

mas 'mindnode', id: 1289197285
